---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecRoomLightingCalcLuminaireplane
source: html/43888d0f-1a7e-49d0-a119-beeeafd96dbd.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecRoomLightingCalcLuminaireplane Property

"Lighting Calculation Luminaire Plane"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecRoomLightingCalcLuminaireplane { get; }
```